Tekla.Structures.AnalysisInternal.DotAnalysisModelSpectrumProperties
The sSerialization structure for ModelSpectrumProperties.

Tekla.Structures.AnalysisInternal.DotAnalysisModelSpectrumProperties._AnalysisModelName
The name of the analysis model.

Tekla.Structures.AnalysisInternal.DotAnalysisModelSpectrumProperties._SpectrumModeCount
The count of the spectrum mode.

Tekla.Structures.AnalysisInternal.DotAnalysisModelSpectrumProperties._SpectrumCombination
The spectrum combination.

Tekla.Structures.AnalysisInternal.DotAnalysisModelSpectrumProperties._SpectrumType
The type of the spectrum.

Tekla.Structures.AnalysisInternal.DotAnalysisModelSpectrumProperties._SpectrumInterpolation
The interpolation of the spectrum.

Tekla.Structures.AnalysisInternal.DotAnalysisModelSpectrumProperties._SpectrumXdirectionEnable
This indicates whether the X direction of the spectrum is enabled.

Tekla.Structures.AnalysisInternal.DotAnalysisModelSpectrumProperties._SpectrumYdirectionEnable
This indicates whether the X direction of the spectrum is enabled.

Tekla.Structures.AnalysisInternal.DotAnalysisModelSpectrumProperties._SpectrumZdirectionEnable
This indicates whether the X direction of the spectrum is enabled.

Tekla.Structures.AnalysisInternal.DotAnalysisModelSpectrumProperties._SpectrumDampingType
The type of the spectrum damping.

Tekla.Structures.AnalysisInternal.DotAnalysisModelSpectrumProperties._SpectrumMissingMassEnable
This indicates whether the missing mass of the spectrum is enabled.

Tekla.Structures.AnalysisInternal.DotAnalysisModelSpectrumProperties._SpectrumModalDampingRatioEnable
This indicates whether the damping ratio of the spectrum is enabled.

Tekla.Structures.AnalysisInternal.DotAnalysisModelSpectrumProperties._SpectrumXdirection
The X direction of the spectrum.

Tekla.Structures.AnalysisInternal.DotAnalysisModelSpectrumProperties._SpectrumYdirection
The Y direction of the spectrum.

Tekla.Structures.AnalysisInternal.DotAnalysisModelSpectrumProperties._SpectrumZdirection
The Z direction of the spectrum.

Tekla.Structures.AnalysisInternal.DotAnalysisModelSpectrumProperties._SpectrumDampingFactor
The damping factor of the spectrum.

Tekla.Structures.AnalysisInternal.DotAnalysisModelSpectrumProperties._SpectrumScale
The scape of the spectrum.

Tekla.Structures.AnalysisInternal.DotAnalysisModelSpectrumProperties._SpectrumMissingMass
The missing mass of the spectrum.

Tekla.Structures.AnalysisInternal.DotAnalysisModelSpectrumProperties._SpectrumASCEf1
The ASCEf1 value of the spectrum.

Tekla.Structures.AnalysisInternal.DotAnalysisModelSpectrumProperties._SpectrumASCEf2
The ASCEf2 value of the spectrum.

Tekla.Structures.AnalysisInternal.DotAnalysisModelSpectrumProperties._SpectrumMinimumDampingRatio
The minimum damping ratio of the spectrum.

Tekla.Structures.AnalysisInternal.DotAnalysisModelSpectrumProperties._SpectrumMaximumDampingRatio
The maximum damping ratio of the spectrum.

Tekla.Structures.AnalysisInternal.DotAnalysisModelSpectrumProperties._NumberOfSpectrumPeriod
The number of the periods of the spectrum.

Tekla.Structures.AnalysisInternal.DotAnalysisModelSpectrumProperties._SpectrumPeriod
The list of the periods of the spectrum.

Tekla.Structures.AnalysisInternal.DotAnalysisModelSpectrumProperties._NumberOfSpectrumAcceleration
The number of the accelerations of the spectrum.

Tekla.Structures.AnalysisInternal.DotAnalysisModelSpectrumProperties._SpectrumAcceleration
The list of the accelerations of the spectrum.

Tekla.Structures.AnalysisInternal.DotAnalysisModelSpectrumProperties._NumberOfSpectrumModalDampingRatio
The number of the modal damping ratios of the spectrum.

Tekla.Structures.AnalysisInternal.DotAnalysisModelSpectrumProperties._SpectrumModalDampingRatio
The list of the modal damping ratios of the spectrum.

Tekla.Structures.AnalysisInternal.DotAnalysisModelSpectrumProperties._NumberOfSpectrumDampingPointId
The number of the damping point identifiers of the spectrum.

Tekla.Structures.AnalysisInternal.DotAnalysisModelSpectrumProperties._SpectrumDampingPointId
The list of the damping point identifiers of the spectrum.

Tekla.Structures.AnalysisInternal.DotAnalysisModelSpectrumProperties._NumberOfSpectrumCompositeDampingRatioX
The number of the composite damping rations in X direction of the spectrum.

Tekla.Structures.AnalysisInternal.DotAnalysisModelSpectrumProperties._SpectrumCompositeDampingRatioX
The list of the composite damping rations in X direction of the spectrum.

Tekla.Structures.AnalysisInternal.DotAnalysisModelSpectrumProperties._NumberOfSpectrumCompositeDampingRatioY
The number of the composite damping rations in Y direction of the spectrum.

Tekla.Structures.AnalysisInternal.DotAnalysisModelSpectrumProperties._SpectrumCompositeDampingRatioY
The list of the composite dampinf rations in Y direction of the spectrum.

Tekla.Structures.AnalysisInternal.DotAnalysisModelSpectrumProperties._NumberOfSpectrumCompositeDampingRatioZ
The number of the composite damping rations in Z direction of the spectrum.

Tekla.Structures.AnalysisInternal.DotAnalysisModelSpectrumProperties._SpectrumCompositeDampingRatioZ
The list of the composite dampinf rations in > direction of the spectrum.

Tekla.Structures.AnalysisInternal.DotAnalysisModelSpectrumProperties.ToStruct(Tekla.Structures.Analysis.AnalysisModelSpectrumProperties)
DO NOT USE! For internal usage only!
P: P.

Tekla.Structures.AnalysisInternal.DotAnalysisModelSpectrumProperties.FromStruct(Tekla.Structures.Analysis.AnalysisModelSpectrumProperties)
DO NOT USE! For internal usage only!
P: P.